
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/15791297340)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.claude_lambda_cdk.github_repository_ruleset.this[&#34;main&#34;]
* Update
  * module.claude_lambda_cdk.github_repository.this
* Delete
  * module.claude_lambda_cdk.github_actions_repository_permissions.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.anime-tweet-bot.github_actions_repository_permissions.this has moved to module.anime-tweet-bot.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "anime-tweet-bot"
        # (3 unchanged attributes hidden)
    }

  # module.blog.github_actions_repository_permissions.this has moved to module.blog.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "blog"
        # (3 unchanged attributes hidden)
    }

  # module.boilerplate-saas.github_actions_repository_permissions.this has moved to module.boilerplate-saas.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "boilerplate-saas"
        # (3 unchanged attributes hidden)
    }

  # module.claude_lambda_cdk.github_actions_repository_permissions.this[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from module.claude_lambda_cdk.github_actions_repository_permissions.this)
  - resource "github_actions_repository_permissions" "this" {
      - allowed_actions = "all" -> null
      - enabled         = true -> null
      - id              = "claude-lambda-cdk" -> null
      - repository      = "claude-lambda-cdk" -> null
    }

  # module.claude_lambda_cdk.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
        id                          = "claude-lambda-cdk"
        name                        = "claude-lambda-cdk"
        # (35 unchanged attributes hidden)
    }

  # module.claude_lambda_cdk.github_repository_ruleset.this["main"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "main"
      + node_id     = (known after apply)
      + repository  = "claude-lambda-cdk"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + non_fast_forward              = false
          + required_linear_history       = true
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = true
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # module.dotfiles.github_actions_repository_permissions.this has moved to module.dotfiles.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "dotfiles"
        # (3 unchanged attributes hidden)
    }

  # module.local-workspace-provisioning.github_actions_repository_permissions.this has moved to module.local-workspace-provisioning.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "local-workspace-provisioning"
        # (3 unchanged attributes hidden)
    }

  # module.nana_kana_dialogue_system.github_actions_repository_permissions.this has moved to module.nana_kana_dialogue_system.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "nana-kana-dialogue-system"
        # (3 unchanged attributes hidden)
    }

  # module.obsidian-vault.github_actions_repository_permissions.this has moved to module.obsidian-vault.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "obsidian-vault"
        # (3 unchanged attributes hidden)
    }

  # module.openai-generate-pr-description.github_actions_repository_permissions.this has moved to module.openai-generate-pr-description.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "openai-generate-pr-description"
        # (3 unchanged attributes hidden)
    }

  # module.private-dotfiles.github_actions_repository_permissions.this has moved to module.private-dotfiles.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "private-dotfiles"
        # (3 unchanged attributes hidden)
    }

  # module.renovate-config.github_actions_repository_permissions.this has moved to module.renovate-config.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "renovate-config"
        # (3 unchanged attributes hidden)
    }

  # module.terraform-aws.github_actions_repository_permissions.this has moved to module.terraform-aws.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "terraform-aws"
        # (3 unchanged attributes hidden)
    }

  # module.terraform-github.github_actions_repository_permissions.this has moved to module.terraform-github.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "terraform-github"
        # (3 unchanged attributes hidden)
    }

  # module.terraform-vercel.github_actions_repository_permissions.this has moved to module.terraform-vercel.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "terraform-vercel"
        # (3 unchanged attributes hidden)
    }

  # module.time-capsule.github_actions_repository_permissions.this has moved to module.time-capsule.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "time-capsule"
        # (3 unchanged attributes hidden)
    }

  # module.tqer39.github_actions_repository_permissions.this has moved to module.tqer39.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "tqer39"
        # (3 unchanged attributes hidden)
    }

  # module.update-license-year.github_actions_repository_permissions.this has moved to module.update-license-year.github_actions_repository_permissions.this[0]
    resource "github_actions_repository_permissions" "this" {
        id              = "update-license-year"
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-github","PRNumber":1289,"Program":"tfcmt","SHA1":"af4ac700a52d135cb83a79d13bbdc001bef3a8ca","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->